In [2]:
%matplotlib inline
import glob
import json
import pandas as pd
import datetime
import re
from ftfy import fix_text

In [2]:
df = pd.DataFrame(columns = ['user_id', 'login_name', 'gender', 'join_date', 'bio', 'country_id', 'region', 'city', 
                             'is_seller', 'transaction_buy_count', 'transaction_sold_count',
                            'first_name', 'last_name'])
df

Empty DataFrame
Columns: [user_id, login_name, gender, join_date, bio, country_id, region, city, is_seller, transaction_buy_count, transaction_sold_count, first_name, last_name]
Index: []

In [3]:
def fix_text2(text):
    if type(text) is str:
        text = text.replace('\n',' ')
        text = text.replace('\r',' ')
        text = re.sub(' +',' ',text)
        return fix_text(text.rstrip())
    return None

In [4]:
def get_row(file):
    with open(file, 'r') as f:
        d = json.load(f)
        user_id = d['user_id']
        login_name = d['login_name']
        gender = d['gender']
        join_date = datetime.datetime.fromtimestamp(int(d['join_tsz'])).strftime('%Y-%m-%d')
        bio = fix_text2(d['bio'])
        country_id = d['country_id']
        region = fix_text2(d['region'])
        city = fix_text2(d['city'])
        is_seller = d['is_seller']
        transaction_buy_count = d['transaction_buy_count']
        transaction_sold_count = d['transaction_sold_count']
        first_name = fix_text2(d['first_name'])
        last_name = fix_text2(d['last_name'])
    
    return [user_id, login_name, gender, join_date, bio, country_id, region, city, 
            is_seller, transaction_buy_count, transaction_sold_count, first_name, last_name]

In [5]:
file_list = glob.glob("../_outputs/owners/*.json")
for file in file_list:
    df.loc[len(df)] = get_row(file)

In [6]:
df.head(10)

,user_id,login_name,gender,join_date,bio,country_id,region,city,is_seller,transaction_buy_count,transaction_sold_count,first_name,last_name
0,10000890,Nekojitaka,female,2010-05-14,"Creative stuff, mostly handmade jewelry and ar...",103,,Montrouge,True,352,60,None,None
1,100015026,lescra,female,2016-12-15,,None,,,True,0,0,Evelyne,ORIOL
2,100019727,lenadreams,private,2016-10-26,,None,,,True,0,49,None,None
3,100028373,jeanetjobrocante,private,2016-10-26,"I'm a Northern Irish Mum, going solo with my k...",103,,Limoges,True,3,110,jo,None
4,100029313,licie777,female,2016-10-26,"Hello, ladies !! My name is Lucie Vidal, I liv...",103,,Annecy-le-Vieux,True,8,18,Lucie,Vidal
5,100033171,florencebernal,female,2016-10-26,,103,,Servian,True,0,5,FLORENCE,BERNAL
6,100056321,delphineajc,private,2016-10-26,,None,,,True,1,0,None,None
7,100073924,hassibakessaci,female,2016-12-16,,None,,,True,0,0,Hassiba,Kessaci
8,100086489,aurelienleshape,male,2016-10-27,,103,,Bordeaux,True,0,3,Aur√©lien,Duffo
9,100087641,daledenise,female,2016-10-27,I am English and am so lucky to have lived in ...,103,,Eymet,True,1,539,denise,dale

In [7]:
df.describe()

,user_id,login_name,gender,join_date,bio,country_id,region,city,is_seller,transaction_buy_count,transaction_sold_count,first_name,last_name
count,14415,14415,14415,14415,14415,10544,14415,14415,14415,14415,14415,12984,8343
unique,14415,14415,82,2733,7386,24,56,3859,2,431,850,6081,6983
top,31392641,CaptainBretzel,female,2017-07-03,,103,,,True,0,0,,
freq,1,1,9699,500,7023,10489,13784,3190,14414,7860,4266,228,228

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 14415 entries, 0 to 14414
Data columns (total 13 columns):
user_id                   14415 non-null object
login_name                14415 non-null object
gender                    14415 non-null object
join_date                 14415 non-null object
bio                       14415 non-null object
country_id                10544 non-null object
region                    14415 non-null object
city                      14415 non-null object
is_seller                 14415 non-null object
transaction_buy_count     14415 non-null object
transaction_sold_count    14415 non-null object
first_name                12984 non-null object
last_name                 8343 non-null object
dtypes: object(13)
memory usage: 1.5+ MB

In [9]:
# ExcelWriter pour ne pas convertir les liens
# https://stackoverflow.com/questions/35440528/how-to-save-in-xlsx-long-url-in-cell-using-pandas
# writer = pd.ExcelWriter(r'../_outputs/user_profiles.xlsx', engine='xlsxwriter', options={'strings_to_urls': False})
# df.to_excel(writer)
# writer.close()

In [3]:
df = pd.read_excel('../_outputs/user_profiles.xlsx')

In [4]:
female = df[df['gender'] == 'female']['user_id'].count()
female

9699

In [5]:
male = df[df['gender'] == 'male']['user_id'].count()
male

1234

In [6]:
ratio = female /(female + male)
ratio

0.88713070520442694

In [7]:
df['transaction_buy_count'] = df['transaction_buy_count'].astype(int)
df['transaction_sold_count'] = df['transaction_sold_count'].astype(int)

In [8]:
df[df['gender'].isin(['female', 'male'])].groupby('gender')['transaction_buy_count', 'transaction_sold_count'].mean()

        transaction_buy_count  transaction_sold_count
gender
female              26.517373               98.414579
male                 4.924635              105.902755

In [53]:
df.gender.unique()

array(['female', 'private', 'male', nan, 'family', 'Artiste', 'couple',
       'furry', 'artiste', 'Marque', 'Couple', 'witch',
       'Magicienne de li√®ge', 'Studio', 'Magasin', 'Collectif cr√©atif',
       'groupe', 'mari√©', 'Both', 'Entreprise', 'Artisan', 'Famille',
       'PRO', 'both', 'Boutique', 'Cr√©ateur', 'L√©zard', 'Lak&#39;s Artes',
       'cr√©atrice', 'galerie d&#39;art', 'genderfluid', 'Team BUBU',
       'SylHulaGirl', 'Alien', 'Viro', 'guru', 'Plasticien',
       'ourse-papillon', 'Etre de lumi√®re', 'Petite entreprise',
       'GUILLOU Corinne', 'Agender', 'Poulpe',
       'Petite cr√©atrice de carnets et d&#39;accessoires', 'Cr√©atrice',
       'h/f', 'Princesse', 'socks', '3 femmes', 'Unisexe', 'Bin√¥me',
       'Synergie', 'Marque de mobilier design scandinave', '√Çme', 'Soeurs',
       'Deux soeurs qui s&#39;adorent !', 'femme chat', 'man en vrouw',
       'chat', 'Atelier de design', '1 homme et 1 femme', 'PROFESSIONNEL',
       'Soci√©t√©', 'F&H', 'Renard', 'boutique', 'üåµ', 'Un couple',
       'boutique r√©tro', '1000ola', 'on est deux !', 'Aurore',
       'Une histoire de famille', 'Wolf', 'atelier', 'Human being',
       'Couple d&#39;artistes', 'Gender Free', 'JeanLiane', 'Femmes',
       'Night Owl', 'nintai art'], dtype=object)

In [58]:
# df.sort_values('count',ascending=False).groupby('city')['user_id'].count()
df[['city']].groupby(['city'])['city'] \
                             .count() \
                             .reset_index(name='count') \
                             .sort_values(['count'], ascending=False) \
                             .head(20)

                 city  count
2460            Paris   1605
1929             Lyon    377
3462         Toulouse    305
422          Bordeaux    249
2311           Nantes    219
1839            Lille    174
2024        Marseille    155
2218      Montpellier    151
2759           Rennes    125
2329             Nice    123
3370       Strasbourg    115
1296         Grenoble     72
37    Aix-en-Provence     71
2836            Rouen     61
1844          Limoges     56
90             Angers     53
2306            Nancy     53
218           Avignon     46
3471            Tours     46
1583      La Rochelle     46